In [ ]:
# NaN类型的缺失值

In [1]:
import pandas as pd

In [3]:
movie = pd.read_csv("./02-代码/IMDB/IMDB-Movie-Data.csv")

In [8]:
import numpy as np

In [9]:
np.any(pd.isnull(movie))

np.True_

In [10]:
pd.isnull(movie).any()

Rank                  False
Title                 False
Genre                 False
Description           False
Director              False
Actors                False
Year                  False
Runtime (Minutes)     False
Rating                False
Votes                 False
Revenue (Millions)     True
Metascore              True
dtype: bool

In [14]:
data1 = movie.dropna(inplace=False)

In [15]:
pd.isnull(data1).any()

Rank                  False
Title                 False
Genre                 False
Description           False
Director              False
Actors                False
Year                  False
Runtime (Minutes)     False
Rating                False
Votes                 False
Revenue (Millions)    False
Metascore             False
dtype: bool

In [21]:
# 含有缺失值的字段
# Revenue (Millions)    
# Metascore
# movie["Revenue (Millions)"] = movie["Revenue (Millions)"].fillna(movie["Revenue (Millions)"].mean())
# movie["Metascore"] = movie["Metascore"].fillna(movie["Metascore"].mean())

movie.fillna({"Revenue (Millions)": movie["Revenue (Millions)"].mean(),
              "Metascore": movie["Metascore"].mean()}, inplace=True)

In [22]:
pd.isnull(movie).any()

Rank                  False
Title                 False
Genre                 False
Description           False
Director              False
Actors                False
Year                  False
Runtime (Minutes)     False
Rating                False
Votes                 False
Revenue (Millions)    False
Metascore             False
dtype: bool

In [23]:
# 不是缺失值nan，有默认标记的

In [24]:
path = "https://archive.ics.uci.edu/ml/machine-learning-databases/breast-cancer-wisconsin/breast-cancer-wisconsin.data"
name = ["Sample code number", "Clump Thickness", "Uniformity of Cell Size", "Uniformity of Cell Shape", "Marginal Adhesion", "Single Epithelial Cell Size", "Bare Nuclei", "Bland Chromatin", "Normal Nucleoli", "Mitoses", "Class"]


data = pd.read_csv(path, names=name)

In [25]:
data.head()

,Sample code number,Clump Thickness,Uniformity of Cell Size,Uniformity of Cell Shape,Marginal Adhesion,Single Epithelial Cell Size,Bare Nuclei,Bland Chromatin,Normal Nucleoli,Mitoses,Class
0,1000025,5,1,1,1,2,1,3,1,1,2
1,1002945,5,4,4,5,7,10,3,2,1,2
2,1015425,3,1,1,1,2,2,3,1,1,2
3,1016277,6,8,8,1,3,4,3,7,1,2
4,1017023,4,1,1,3,2,1,3,1,1,2

In [26]:
new_data = data.replace(to_replace="?",value=np.nan)

In [27]:
pd.isnull(new_data).any()

Sample code number             False
Clump Thickness                False
Uniformity of Cell Size        False
Uniformity of Cell Shape       False
Marginal Adhesion              False
Single Epithelial Cell Size    False
Bare Nuclei                     True
Bland Chromatin                False
Normal Nucleoli                False
Mitoses                        False
Class                          False
dtype: bool

In [28]:
new_data.dropna(inplace=True)

In [29]:
new_data.isnull().any()

Sample code number             False
Clump Thickness                False
Uniformity of Cell Size        False
Uniformity of Cell Shape       False
Marginal Adhesion              False
Single Epithelial Cell Size    False
Bare Nuclei                    False
Bland Chromatin                False
Normal Nucleoli                False
Mitoses                        False
Class                          False
dtype: bool

In [30]:
# 数据离散化

In [31]:
# 自动分组

In [32]:
 # 1）准备数据
data = pd.Series([165,174,160,180,159,163,192,184], index=['No1:165', 'No2:174','No3:160', 'No4:180', 'No5:159', 'No6:163', 'No7:192', 'No8:184'])

In [33]:
data.head()

No1:165    165
No2:174    174
No3:160    160
No4:180    180
No5:159    159
dtype: int64

In [35]:
sr = pd.qcut(data,3)

In [36]:
sr

No1:165      (163.667, 178.0]
No2:174      (163.667, 178.0]
No3:160    (158.999, 163.667]
No4:180        (178.0, 192.0]
No5:159    (158.999, 163.667]
No6:163    (158.999, 163.667]
No7:192        (178.0, 192.0]
No8:184        (178.0, 192.0]
dtype: category
Categories (3, interval[float64, right]): [(158.999, 163.667] < (163.667, 178.0] < (178.0, 192.0]]

In [37]:
sr.value_counts()

(158.999, 163.667]    3
(178.0, 192.0]        3
(163.667, 178.0]      2
Name: count, dtype: int64

In [38]:
pd.get_dummies(sr,prefix="height")

,"height_(158.999, 163.667]","height_(163.667, 178.0]","height_(178.0, 192.0]"
No1:165,False,True,False
No2:174,False,True,False
No3:160,True,False,False
No4:180,False,False,True
No5:159,True,False,False
No6:163,True,False,False
No7:192,False,False,True
No8:184,False,False,True

In [39]:
# 自定义

In [40]:
bins = [150,165,180,195]

In [42]:
sr = pd.cut(data,bins)

In [43]:
sr

No1:165    (150, 165]
No2:174    (165, 180]
No3:160    (150, 165]
No4:180    (165, 180]
No5:159    (150, 165]
No6:163    (150, 165]
No7:192    (180, 195]
No8:184    (180, 195]
dtype: category
Categories (3, interval[int64, right]): [(150, 165] < (165, 180] < (180, 195]]

In [44]:
pd.get_dummies(sr,prefix="height")

         height_(150, 165]  height_(165, 180]  height_(180, 195]
No1:165               True              False              False
No2:174              False               True              False
No3:160               True              False              False
No4:180              False               True              False
No5:159               True              False              False
No6:163               True              False              False
No7:192              False              False               True
No8:184              False              False               True

In [45]:
stock = pd.read_csv("./stock_day/stock_day.csv")

In [46]:
p_change = stock["p_change"]

In [47]:
# 自定义分组
bins = [-100, -7, -5, -3, 0, 3, 5, 7, 100]
sr = pd.cut(p_change, bins)

In [48]:
# one-hot
pd.get_dummies(sr, prefix="rise").head()

,"rise_(-100, -7]","rise_(-7, -5]","rise_(-5, -3]","rise_(-3, 0]","rise_(0, 3]","rise_(3, 5]","rise_(5, 7]","rise_(7, 100]"
2018-02-27,False,False,False,False,True,False,False,False
2018-02-26,False,False,False,False,False,True,False,False
2018-02-23,False,False,False,False,True,False,False,False
2018-02-22,False,False,False,False,True,False,False,False
2018-02-14,False,False,False,False,True,False,False,False

In [49]:
stock_change = pd.get_dummies(sr, prefix="rise")

In [50]:
# 合并

In [52]:
pd.concat([stock, stock_change], axis=1).head()

,open,high,close,low,volume,price_change,p_change,ma5,ma10,ma20,...,v_ma20,turnover,"rise_(-100, -7]","rise_(-7, -5]","rise_(-5, -3]","rise_(-3, 0]","rise_(0, 3]","rise_(3, 5]","rise_(5, 7]","rise_(7, 100]"
2018-02-27,23.53,25.88,24.16,23.53,95578.03,0.63,2.68,22.942,22.142,22.875,...,55576.11,2.39,False,False,False,False,True,False,False,False
2018-02-26,22.80,23.78,23.53,22.80,60985.11,0.69,3.02,22.406,21.955,22.942,...,56007.50,1.53,False,False,False,False,False,True,False,False
2018-02-23,22.88,23.37,22.82,22.71,52914.01,0.54,2.42,21.938,21.929,23.022,...,56372.85,1.32,False,False,False,False,True,False,False,False
2018-02-22,22.25,22.76,22.28,22.02,36105.01,0.36,1.64,21.446,21.909,23.137,...,60149.60,0.90,False,False,False,False,True,False,False,False
2018-02-14,21.49,21.99,21.92,21.48,23331.04,0.44,2.05,21.366,21.923,23.253,...,61716.11,0.58,False,False,False,False,True,False,False,False

In [53]:
# pd.merge合并

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.